mdhardenburgh/Blinky/Packages/.cache/Atmel.SAMV71_DFP.2.4.182.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71Q21">
         <description>Headers and startup code for Atmel ATSAMV71Q21</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71q21.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71q21.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71q21_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71q21_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71q21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71q21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71q21/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71q21/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71N21">
         <description>Headers and startup code for Atmel ATSAMV71N21</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71n21.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71n21.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71n21_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71n21_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71n21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71n21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71n21/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71n21/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71N20">
         <description>Headers and startup code for Atmel ATSAMV71N20</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71n20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71n20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71n20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71n20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71n20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71n20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71n20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71n20/flash.icf" attr="config"/>
         </files>
      </component>
